blazoncek/esp8266_mqtt_leds/effects.cpp
//------------------------------------------------------//
// colorChase with only two colors, with each section shifted 1 pixel
// this will simulate rotating spiral
// we have to assume equal number of leds in each section
void rotateChase(CRGB c, int speedDelay) {
  static uint8_t q[MAXZONES]; // even though it may be uninitialized it is ok

  for ( int z=(bobClient && bobClient.connected())?1:0; z<numZones; z++ ) {
    int window = 2*numSections[z];
    // move by 1 pixel each run
    ++q[z] %= window; // we fix uninitialized value

    fill_solid(leds[z], numLEDs[z], CRGB::Black);

    for ( int s=0; s<numSections[z]; s++ ) {
      int ledsPerSection = sectionEnd[z][s]-sectionStart[z][s]+1;

      for ( int i=0; i<ledsPerSection; i+=window ) {
        // turn LEDs on: ..++++....++++..   (size=4, . = black, + = c)
        for ( int j=0; j<numSections[z]; j++ ) {  // size == numSections[z]
          uint16_t pos = s + q[z] + j;

          // Every odd section is reversed (zig-zag mounted strips)
          if ( (s%2) ) {
            if ( pos%window + i < ledsPerSection )
              leds[z][sectionEnd[z][s] - pos%window - i] = c;
          } else {
            if ( pos%window + i < ledsPerSection )
              leds[z][sectionStart[z][s] + pos%window + i] = c;
          }

        }
      }
    }
  }
  showStrip();
  FastLED.delay(speedDelay);
}

// ***************************************
// ** Common Functions **
// ***************************************

unsigned int getPosFromPct(unsigned int pct, unsigned int ledsPerSection, byte width, bool Reverse) {
  if ( width<1 || width>=ledsPerSection ) return 0;
  return (unsigned int) round(((float)((Reverse ? 100-pct : pct) * (ledsPerSection-width)) / 100));
}

void addGlitter(int zone, int section, fract8 chanceOfGlitter) {
  if ( (random8()*100)/255 < chanceOfGlitter ) {
    for ( int i=0; i<random8(1,5); i++ )  // at least one dot per 50 pixels
      leds[zone][ random16(sectionStart[zone][section],sectionEnd[zone][section]) ] = CRGB::White; // 100% white
  }
}

// Color wheel (get RGB from hue)
CRGB * getRGBfromHue(byte hue) {
  static CRGB c;
  
  if ( hue < 85 ) {
   c.r = hue * 3;
   c.g = 255 - hue * 3;
   c.b = 0;
  } else if ( hue < 170 ) {
   hue -= 85;
   c.r = 255 - hue * 3;
   c.g = 0;
   c.b = hue * 3;
  } else {
   hue -= 170;
   c.r = 0;
   c.g = hue * 3;
   c.b = 255 - hue * 3;
  }

  return &c;
}

CRGB * getRGBfromHeat(byte temp) {
  static CRGB c;

  // Scale 'heat' down from 0-255 to 0-191
  byte t192 = (byte)(((int)temp*191)/255);
 
  // calculate ramp up from
  byte heatramp = t192 & 0x3F; // 0..63
  heatramp <<= 2; // scale up to 0..252
 
  // figure out which third of the spectrum we're in:
  if( t192 > 0x80) {                     // hottest
    c = CRGB(255, 255, heatramp);
  } else if( t192 > 0x40 ) {             // middle
    c = CRGB(255, heatramp, 0);
  } else {                               // coolest
    c = CRGB(heatramp, 0, 0);
  }
  return &c;
}
